Catalogs/Nomenclature.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Nomenclature</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.NomenclatureCategories</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Article</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionLong</Name>
					<Comment>Descriptive name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EnableCustomsDeclarations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EnableSerialNumbers</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.NomenclatureTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.NomenclatureAccessGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>UserDefinedProperties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalPropertiesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalPropertiesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/NomenclaturePropertyAssignmentLevel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>NomenclaturePropertyAssignmentLevel</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DoNotUse</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NomenclatureCategoryLevel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NomenclatureItemLevel</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Nomenclature/Ext/ManagerModule.bsl
Function CheckCharacteristicAndPackageOwnership(Nomenclature, Characteristic, Package) Export

	CharactiristicDoesNotBelongToTheOwner = ValueIsFilled(Characteristic);
	PackageDoesNotBelongToTheOwner       = ValueIsFilled(Package);
	If CharactiristicDoesNotBelongToTheOwner OR PackageDoesNotBelongToTheOwner Then
		Query = New Query;
		Query.SetParameter("Nomenclature", Nomenclature);

		QueryText = "";

		If CharactiristicDoesNotBelongToTheOwner Then
			QueryText = "SELECT TOP 1
			            |	1 AS Result
			            |FROM
			            |	Catalog.Nomenclature AS CatalogNomenclature
			            |		INNER JOIN Catalog.NomenclatureCharacteristics AS CatalogCharacteristics
			            |		ON (CatalogCharacteristics.Owner = CASE
			            |				WHEN CatalogNomenclature.Category.CharacteristicUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureCategoryLevel)
			            |					THEN CatalogNomenclature.Category
			            |				WHEN CatalogNomenclature.Category.CharacteristicUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureItemLevel)
			            |					THEN CatalogNomenclature.Ref
			            |				ELSE FALSE
			            |			END)
			            |WHERE
			            |	CatalogNomenclature.Ref = &Nomenclature
			            |	AND CatalogCharacteristics.Ref = &Characteristic";

			Query.SetParameter("Characteristic", Characteristic);
		EndIf;

		If PackageDoesNotBelongToTheOwner Then
			If CharactiristicDoesNotBelongToTheOwner Then
				QueryText = QueryText + "
				|UNION ALL";
			EndIf;

			QueryText = QueryText + "SELECT TOP 1
			                        |	2 AS Result
			                        |FROM
			                        |	Catalog.Nomenclature AS CatalogNomenclature
			                        |		INNER JOIN Catalog.NomenclaturePackages AS CatalogPackages
			                        |		ON (CatalogPackages.Owner = CASE
			                        |				WHEN CatalogNomenclature.Category.PackageUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureCategoryLevel)
			                        |					THEN CatalogNomenclature.Category
			                        |				WHEN CatalogNomenclature.Category.PackageUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureItemLevel)
			                        |					THEN CatalogNomenclature.Ref
			                        |				ELSE FALSE
			                        |			END)
			                        |WHERE
			                        |	CatalogNomenclature.Ref = &Nomenclature
			                        |	AND CatalogPackages.Ref = &Package";

			Query.SetParameter("Package", Package);
		EndIf;

		Query.Text = QueryText;

		Selection = Query.Execute().Choose();
		While Selection.Next() Do
			If Selection.Result = 1 Then
				CharactiristicDoesNotBelongToTheOwner = False;
			ElsIf Selection.Result = 2 Then
				PackageDoesNotBelongToTheOwner = False;
			EndIf;
		EndDo;
	EndIf;

	Return New Structure("CharactiristicDoesNotBelongToTheOwner, PackageDoesNotBelongToTheOwner",
	   CharactiristicDoesNotBelongToTheOwner,
	   PackageDoesNotBelongToTheOwner);

EndFunction


Function GetKeyAttributes() Export

	Result = New Array;
	Result.Add("Category");
	Result.Add("EnableCustomsDeclarations");

	Return Result;

EndFunction
